In [1]:
#Thalaiva

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
my_data = [1,2,3,4,5,6,7,8]
labels = ['One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven', 'Eight']
numbers_dict = {
    1: 'One',
    2: 'Two',
    3: 'Three',
    4: 'Four',
    5: 'Five',
    6: 'Six',
    7: 'Seven',
    8: 'Eight'
}
arr_ex = np.array(my_data)

In [5]:
my_data

[1, 2, 3, 4, 5, 6, 7, 8]

In [6]:
labels

['One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven', 'Eight']

In [7]:
numbers_dict

{1: 'One',
 2: 'Two',
 3: 'Three',
 4: 'Four',
 5: 'Five',
 6: 'Six',
 7: 'Seven',
 8: 'Eight'}

In [8]:
arr_ex

array([1, 2, 3, 4, 5, 6, 7, 8])

In [9]:
pd.Series(data= my_data)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [10]:
pd.Series(my_data,labels)

One      1
Two      2
Three    3
Four     4
Five     5
Six      6
Seven    7
Eight    8
dtype: int64

In [11]:
pd.Series(arr_ex,index=labels)

One      1
Two      2
Three    3
Four     4
Five     5
Six      6
Seven    7
Eight    8
dtype: int32

In [12]:
pd.Series(numbers_dict)

1      One
2      Two
3    Three
4     Four
5     Five
6      Six
7    Seven
8    Eight
dtype: object

In [13]:
# Combining Values

In [14]:
example_ser1 = pd.Series([1,2,3,4,5,6],['United States', 'Canada', 'United Kingdom', 'Australia', 'Germany', 'Japan'])

In [15]:
example_ser1

United States     1
Canada            2
United Kingdom    3
Australia         4
Germany           5
Japan             6
dtype: int64

In [16]:
example_ser2 = pd.Series([1,2,3,4,5,6], ['France', 'Brazil', 'China', 'India', 'Mexico', 'South Africa'])

In [17]:
example_ser2

France          1
Brazil          2
China           3
India           4
Mexico          5
South Africa    6
dtype: int64

In [18]:
example_ser1 + example_ser2

Australia        NaN
Brazil           NaN
Canada           NaN
China            NaN
France           NaN
Germany          NaN
India            NaN
Japan            NaN
Mexico           NaN
South Africa     NaN
United Kingdom   NaN
United States    NaN
dtype: float64

In [19]:
example_ser3 = example_ser1

In [20]:
example_ser1 + example_ser3

United States      2
Canada             4
United Kingdom     6
Australia          8
Germany           10
Japan             12
dtype: int64

In [21]:
example_ser4 = pd.Series([99,2,3,4,0,6],['United States', 'Canada', 'United Kingdom', 'Australia', 'Germany', 'Japan'])

In [22]:
example_ser1 + example_ser4

United States     100
Canada              4
United Kingdom      6
Australia           8
Germany             5
Japan              12
dtype: int64

In [23]:
example_ser5 = pd.Series([99,2,3,4,0,6],['India', 'Canada', 'United Kingdom', 'Australia', 'Germany', 'Japan'])

In [24]:
example_ser1 + example_ser5

Australia          8.0
Canada             4.0
Germany            5.0
India              NaN
Japan             12.0
United Kingdom     6.0
United States      NaN
dtype: float64

In [25]:
# These are some operations that we can do

In [26]:
example_ser1 - example_ser5

Australia         0.0
Canada            0.0
Germany           5.0
India             NaN
Japan             0.0
United Kingdom    0.0
United States     NaN
dtype: float64

In [27]:
example_ser1 * example_ser4

United States     99
Canada             4
United Kingdom     9
Australia         16
Germany            0
Japan             36
dtype: int64

In [28]:
example_ser1 / example_ser4

United States     0.010101
Canada            1.000000
United Kingdom    1.000000
Australia         1.000000
Germany                inf
Japan             1.000000
dtype: float64

In [29]:
example_ser1 ^ example_ser4

United States     98
Canada             0
United Kingdom     0
Australia          0
Germany            5
Japan              0
dtype: int64

In [30]:
example_ser1 & example_ser4

United States     1
Canada            2
United Kingdom    3
Australia         4
Germany           0
Japan             6
dtype: int64

In [31]:
example_ser1 % example_ser4

United States     1.0
Canada            0.0
United Kingdom    0.0
Australia         0.0
Germany           NaN
Japan             0.0
dtype: float64

These are some examples

In [32]:
from numpy.random import randn
np.random.seed(101)

In [33]:
food_names = ['Spaghetti Bolognese', 'Chicken Tikka Masala', 'Caprese Salad', 'Mango Sticky Rice', 'Grilled Salmon']
food_countries = ['United States', 'Canada', 'United Kingdom', 'Australia', 'Japan']

In [34]:
food_values = pd.DataFrame(randn(5,5),food_names,food_countries)

In [35]:
food_values

,United States,Canada,United Kingdom,Australia,Japan
Spaghetti Bolognese,2.706850,0.628133,0.907969,0.503826,0.651118
Chicken Tikka Masala,-0.319318,-0.848077,0.605965,-2.018168,0.740122
Caprese Salad,0.528813,-0.589001,0.188695,-0.758872,-0.933237
Mango Sticky Rice,0.955057,0.190794,1.978757,2.605967,0.683509
Grilled Salmon,0.302665,1.693723,-1.706086,-1.159119,-0.134841

In [36]:
#food_values.loc['Panner Butter Masala'] = pd.DataFrame(randn(1,5),index= ["Panner Butter Masala"],columns= food_countries)

In [37]:
randn(1,5)

array([[0.39052784, 0.16690464, 0.18450186, 0.80770591, 0.07295968]])

In [38]:
food_values2 = pd.DataFrame(randn(5,5),food_names,food_countries)

In [39]:
food_values2.add(randn(1,5),axis = 0)

,United States,Canada,United Kingdom,Australia,Japan
Spaghetti Bolognese,1.663597,1.354457,0.527706,0.270741,0.081404
Chicken Tikka Masala,-0.441123,-1.042648,0.975881,-0.687747,1.070778
Caprese Salad,0.869601,2.059664,0.726220,1.863231,2.888848
Mango Sticky Rice,-1.290415,-1.165396,-0.483991,1.021029,-1.744076
Grilled Salmon,-0.144847,0.264059,0.757505,0.131030,1.169247

In [40]:
#food_values.loc['Panner Butter Masala'] = food_values.add(randn(1,5))

In [41]:
food_values

,United States,Canada,United Kingdom,Australia,Japan
Spaghetti Bolognese,2.706850,0.628133,0.907969,0.503826,0.651118
Chicken Tikka Masala,-0.319318,-0.848077,0.605965,-2.018168,0.740122
Caprese Salad,0.528813,-0.589001,0.188695,-0.758872,-0.933237
Mango Sticky Rice,0.955057,0.190794,1.978757,2.605967,0.683509
Grilled Salmon,0.302665,1.693723,-1.706086,-1.159119,-0.134841

In [42]:
food_values['India'] = food_values['United States'] + food_values['United Kingdom']

In [43]:
food_values

,United States,Canada,United Kingdom,Australia,Japan,India
Spaghetti Bolognese,2.706850,0.628133,0.907969,0.503826,0.651118,3.614819
Chicken Tikka Masala,-0.319318,-0.848077,0.605965,-2.018168,0.740122,0.286647
Caprese Salad,0.528813,-0.589001,0.188695,-0.758872,-0.933237,0.717509
Mango Sticky Rice,0.955057,0.190794,1.978757,2.605967,0.683509,2.933814
Grilled Salmon,0.302665,1.693723,-1.706086,-1.159119,-0.134841,-1.403420

In [44]:
#food_values['Total'] = sum(food_values,axis = 1)

In [45]:
new_row = pd.DataFrame(randn(1,5))

In [46]:
new_row

         0         1         2         3         4
0  0.38603  2.084019 -0.376519  0.230336  0.681209

In [47]:
#food_values.loc['Panner Butter Masala'] = [12.3,455,6777,888,999]

In [48]:
#food_values.append(new_row)

In [49]:
food_values.drop('India',axis= 1)

,United States,Canada,United Kingdom,Australia,Japan
Spaghetti Bolognese,2.706850,0.628133,0.907969,0.503826,0.651118
Chicken Tikka Masala,-0.319318,-0.848077,0.605965,-2.018168,0.740122
Caprese Salad,0.528813,-0.589001,0.188695,-0.758872,-0.933237
Mango Sticky Rice,0.955057,0.190794,1.978757,2.605967,0.683509
Grilled Salmon,0.302665,1.693723,-1.706086,-1.159119,-0.134841

In [50]:
food_values

,United States,Canada,United Kingdom,Australia,Japan,India
Spaghetti Bolognese,2.706850,0.628133,0.907969,0.503826,0.651118,3.614819
Chicken Tikka Masala,-0.319318,-0.848077,0.605965,-2.018168,0.740122,0.286647
Caprese Salad,0.528813,-0.589001,0.188695,-0.758872,-0.933237,0.717509
Mango Sticky Rice,0.955057,0.190794,1.978757,2.605967,0.683509,2.933814
Grilled Salmon,0.302665,1.693723,-1.706086,-1.159119,-0.134841,-1.403420

In [51]:
food_values2.drop('Japan',axis = 1,inplace = True)

In [52]:
food_values2

                      United States    Canada  United Kingdom  Australia
Spaghetti Bolognese        0.638787  0.329646       -0.497104  -0.754070
Chicken Tikka Masala       0.484752 -0.116773        1.901755   0.238127
Caprese Salad             -0.993263  0.196800       -1.136645   0.000366
Mango Sticky Rice         -0.156598 -0.031579        0.649826   2.154846
Grilled Salmon            -0.755325 -0.346419        0.147027  -0.479448

In [53]:
food_values2.drop('Grilled Salmon',inplace = True)

In [54]:
food_values2

                      United States    Canada  United Kingdom  Australia
Spaghetti Bolognese        0.638787  0.329646       -0.497104  -0.754070
Chicken Tikka Masala       0.484752 -0.116773        1.901755   0.238127
Caprese Salad             -0.993263  0.196800       -1.136645   0.000366
Mango Sticky Rice         -0.156598 -0.031579        0.649826   2.154846

In [55]:
food_values['United States']

Spaghetti Bolognese     2.706850
Chicken Tikka Masala   -0.319318
Caprese Salad           0.528813
Mango Sticky Rice       0.955057
Grilled Salmon          0.302665
Name: United States, dtype: float64

In [56]:
food_values.loc['Mango Sticky Rice']

United States     0.955057
Canada            0.190794
United Kingdom    1.978757
Australia         2.605967
Japan             0.683509
India             2.933814
Name: Mango Sticky Rice, dtype: float64

In [57]:
food_values.iloc[3]

United States     0.955057
Canada            0.190794
United Kingdom    1.978757
Australia         2.605967
Japan             0.683509
India             2.933814
Name: Mango Sticky Rice, dtype: float64

In [58]:
food_values.loc[['Chicken Tikka Masala'],['India']]

                         India
Chicken Tikka Masala  0.286647

In [59]:
food_values.loc[['Chicken Tikka Masala',"Grilled Salmon"],['India',"Canada"]]

                         India    Canada
Chicken Tikka Masala  0.286647 -0.848077
Grilled Salmon       -1.403420  1.693723

In [60]:
food_values

,United States,Canada,United Kingdom,Australia,Japan,India
Spaghetti Bolognese,2.706850,0.628133,0.907969,0.503826,0.651118,3.614819
Chicken Tikka Masala,-0.319318,-0.848077,0.605965,-2.018168,0.740122,0.286647
Caprese Salad,0.528813,-0.589001,0.188695,-0.758872,-0.933237,0.717509
Mango Sticky Rice,0.955057,0.190794,1.978757,2.605967,0.683509,2.933814
Grilled Salmon,0.302665,1.693723,-1.706086,-1.159119,-0.134841,-1.403420

In [61]:
food_values.iloc[[3,1],[2,3]]

                      United Kingdom  Australia
Mango Sticky Rice           1.978757   2.605967
Chicken Tikka Masala        0.605965  -2.018168

In [62]:
from random import randint

In [63]:
# New DF

In [64]:
well_known_indian_it_companies = [
    "InfosysTech Solutions",
    "WiproInnovate IT",
    "TataTech Dynamics",
    "HCLInnovations Hub",
    "TechMahindra Systems"
]
indian_cities = ["Mumbai", "Delhi", "Bangalore", "Hyderabad", "Chennai"]

In [65]:
data_frame_new = pd.DataFrame((randn(5,5)*100),well_known_indian_it_companies, indian_cities)

In [66]:
data_frame_new

,Mumbai,Delhi,Bangalore,Hyderabad,Chennai
InfosysTech Solutions,103.512507,-3.116048,193.993231,-100.518692,-74.178970
WiproInnovate IT,18.712452,-73.284515,-138.292010,148.249550,96.145816
TataTech Dynamics,-214.121229,99.257345,119.224064,-104.677954,129.276458
HCLInnovations Hub,-146.751402,-49.409536,-16.253473,48.580874,39.248881
TechMahindra Systems,22.149069,-85.519604,154.199041,66.631932,-53.823463

In [67]:
data_frame_new > 0

                       Mumbai  Delhi  Bangalore  Hyderabad  Chennai
InfosysTech Solutions    True  False       True      False    False
WiproInnovate IT         True  False      False       True     True
TataTech Dynamics       False   True       True      False     True
HCLInnovations Hub      False  False      False       True     True
TechMahindra Systems     True  False       True       True    False

In [68]:
data_frame_new[data_frame_new>0]

,Mumbai,Delhi,Bangalore,Hyderabad,Chennai
InfosysTech Solutions,103.512507,NaN,193.993231,NaN,NaN
WiproInnovate IT,18.712452,NaN,NaN,148.249550,96.145816
TataTech Dynamics,NaN,99.257345,119.224064,NaN,129.276458
HCLInnovations Hub,NaN,NaN,NaN,48.580874,39.248881
TechMahindra Systems,22.149069,NaN,154.199041,66.631932,NaN

In [69]:
#data_frame_new[data_frame_new.loc["WiproInnovate IT"] > 0] #"-----------------------> ERROR!!!"

In [70]:
[data_frame_new.loc["WiproInnovate IT"] > 0]

[Mumbai        True
 Delhi        False
 Bangalore    False
 Hyderabad     True
 Chennai       True
 Name: WiproInnovate IT, dtype: bool]

In [71]:
data_frame_new[ data_frame_new["Delhi"] > 0 ]

                       Mumbai      Delhi   Bangalore   Hyderabad     Chennai
TataTech Dynamics -214.121229  99.257345  119.224064 -104.677954  129.276458

In [72]:
#data_frame_new[ data_frame_new["Delhi"] > 0 and data_frame_new["Bangalore"] < 0 ]  # ERROR OF AND!!!

In [73]:
data_frame_new[ (data_frame_new["Delhi"] > 0) & (data_frame_new["Bangalore"] < 0) ]

Empty DataFrame
Columns: [Mumbai, Delhi, Bangalore, Hyderabad, Chennai]
Index: []

In [74]:
data_frame_new[ (data_frame_new["Delhi"] > 0) | (data_frame_new["Bangalore"] < 0) ]

                        Mumbai      Delhi   Bangalore   Hyderabad     Chennai
WiproInnovate IT     18.712452 -73.284515 -138.292010  148.249550   96.145816
TataTech Dynamics  -214.121229  99.257345  119.224064 -104.677954  129.276458
HCLInnovations Hub -146.751402 -49.409536  -16.253473   48.580874   39.248881

In [75]:
#data_frame_new[ (data_frame_new["Delhi"] > 0) or (data_frame_new["Bangalore"] < 0) ]  # ERROR for OR!!!

In [76]:
data_frame_new[(data_frame_new["Delhi"] < 0) | (data_frame_new["Chennai"] >=0) | (data_frame_new["Hyderabad"] < 0) ]

,Mumbai,Delhi,Bangalore,Hyderabad,Chennai
InfosysTech Solutions,103.512507,-3.116048,193.993231,-100.518692,-74.178970
WiproInnovate IT,18.712452,-73.284515,-138.292010,148.249550,96.145816
TataTech Dynamics,-214.121229,99.257345,119.224064,-104.677954,129.276458
HCLInnovations Hub,-146.751402,-49.409536,-16.253473,48.580874,39.248881
TechMahindra Systems,22.149069,-85.519604,154.199041,66.631932,-53.823463

In [77]:
# Indexs

In [78]:
New_index = "GUJ TN PJ HYD BNG".split()

In [79]:
data_frame_new.reset_index()

,index,Mumbai,Delhi,Bangalore,Hyderabad,Chennai
0,InfosysTech Solutions,103.512507,-3.116048,193.993231,-100.518692,-74.178970
1,WiproInnovate IT,18.712452,-73.284515,-138.292010,148.249550,96.145816
2,TataTech Dynamics,-214.121229,99.257345,119.224064,-104.677954,129.276458
3,HCLInnovations Hub,-146.751402,-49.409536,-16.253473,48.580874,39.248881
4,TechMahindra Systems,22.149069,-85.519604,154.199041,66.631932,-53.823463

In [80]:
data_frame_new["States"] = New_index

In [81]:
data_frame_new

,Mumbai,Delhi,Bangalore,Hyderabad,Chennai,States
InfosysTech Solutions,103.512507,-3.116048,193.993231,-100.518692,-74.178970,GUJ
WiproInnovate IT,18.712452,-73.284515,-138.292010,148.249550,96.145816,TN
TataTech Dynamics,-214.121229,99.257345,119.224064,-104.677954,129.276458,PJ
HCLInnovations Hub,-146.751402,-49.409536,-16.253473,48.580874,39.248881,HYD
TechMahindra Systems,22.149069,-85.519604,154.199041,66.631932,-53.823463,BNG

In [82]:
data_frame_new.reset_index()

,index,Mumbai,Delhi,Bangalore,Hyderabad,Chennai,States
0,InfosysTech Solutions,103.512507,-3.116048,193.993231,-100.518692,-74.178970,GUJ
1,WiproInnovate IT,18.712452,-73.284515,-138.292010,148.249550,96.145816,TN
2,TataTech Dynamics,-214.121229,99.257345,119.224064,-104.677954,129.276458,PJ
3,HCLInnovations Hub,-146.751402,-49.409536,-16.253473,48.580874,39.248881,HYD
4,TechMahindra Systems,22.149069,-85.519604,154.199041,66.631932,-53.823463,BNG

In [83]:
data_frame_new.set_index("States")

            Mumbai      Delhi   Bangalore   Hyderabad     Chennai
States
GUJ     103.512507  -3.116048  193.993231 -100.518692  -74.178970
TN       18.712452 -73.284515 -138.292010  148.249550   96.145816
PJ     -214.121229  99.257345  119.224064 -104.677954  129.276458
HYD    -146.751402 -49.409536  -16.253473   48.580874   39.248881
BNG      22.149069 -85.519604  154.199041   66.631932  -53.823463

In [84]:
data_frame_new

,Mumbai,Delhi,Bangalore,Hyderabad,Chennai,States
InfosysTech Solutions,103.512507,-3.116048,193.993231,-100.518692,-74.178970,GUJ
WiproInnovate IT,18.712452,-73.284515,-138.292010,148.249550,96.145816,TN
TataTech Dynamics,-214.121229,99.257345,119.224064,-104.677954,129.276458,PJ
HCLInnovations Hub,-146.751402,-49.409536,-16.253473,48.580874,39.248881,HYD
TechMahindra Systems,22.149069,-85.519604,154.199041,66.631932,-53.823463,BNG

In [85]:
data_frame_new.reset_index(inplace= True)

In [86]:
data_frame_new.set_index("States",inplace=True)

In [87]:
data_frame_new

,index,Mumbai,Delhi,Bangalore,Hyderabad,Chennai
States,,,,,,
GUJ,InfosysTech Solutions,103.512507,-3.116048,193.993231,-100.518692,-74.178970
TN,WiproInnovate IT,18.712452,-73.284515,-138.292010,148.249550,96.145816
PJ,TataTech Dynamics,-214.121229,99.257345,119.224064,-104.677954,129.276458
HYD,HCLInnovations Hub,-146.751402,-49.409536,-16.253473,48.580874,39.248881
BNG,TechMahindra Systems,22.149069,-85.519604,154.199041,66.631932,-53.823463

In [88]:
# Multi Indexing

In [89]:
# Basic

In [90]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [91]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [92]:
#df = pd.MultiIndex.from_tuples(randn(6,2),hier_index, ["A","B"]) # Wrong

In [93]:
multi_level_df = pd.DataFrame(randn(6,3),index= hier_index,columns="A B C".split())

In [94]:
multi_level_df

             A         B         C
G1 1 -0.568581  1.407338  0.641806
   2 -0.905100 -0.391157  1.028293
   3 -1.972605 -0.866885  0.720788
G2 1 -1.223082  1.606780 -1.115710
   2 -1.385379 -1.329660  0.041460
   3 -0.411055 -0.771329  0.110477

In [95]:
# Grabing

In [96]:
multi_level_df.loc['G1'].loc[1]["A"]

-0.5685813606701186

In [97]:
if multi_level_df.loc['G1'].loc[1]["A"] > 0 :
    print(multi_level_df)
    print("\n\nData Frame is big")

In [98]:
multi_level_df.index.names

FrozenList([None, None])

In [99]:
multi_level_df.index.names = ["Groups","Section"]

In [100]:
multi_level_df

                       A         B         C
Groups Section
G1     1       -0.568581  1.407338  0.641806
       2       -0.905100 -0.391157  1.028293
       3       -1.972605 -0.866885  0.720788
G2     1       -1.223082  1.606780 -1.115710
       2       -1.385379 -1.329660  0.041460
       3       -0.411055 -0.771329  0.110477

In [101]:
#multi_level_df.xs('G1',1)

In [102]:
multi_level_df.xs(1,level='Section')

               A         B         C
Groups
G1     -0.568581  1.407338  0.641806
G2     -1.223082  1.606780 -1.115710

In [103]:
multi_level_df.xs(2,level='Section')

               A         B         C
Groups
G1     -0.905100 -0.391157  1.028293
G2     -1.385379 -1.329660  0.041460

In [104]:
# Missing Data

In [105]:
nil = np.nan

In [106]:
my_dict = {
    'A': [1, 2, 3, 4, nil, 6],
    'B': [nil, 8, 9, nil, 11, 12],
    'C': [13, 14, 15, nil, 17, nil],
    'D': [19, 20, 21, 22, 23, 24]
}

print(my_dict)

{'A': [1, 2, 3, 4, nan, 6], 'B': [nan, 8, 9, nan, 11, 12], 'C': [13, 14, 15, nan, 17, nan], 'D': [19, 20, 21, 22, 23, 24]}

In [107]:
missing_df = pd.DataFrame(my_dict)

In [108]:
missing_df

     A     B     C   D
0  1.0   NaN  13.0  19
1  2.0   8.0  14.0  20
2  3.0   9.0  15.0  21
3  4.0   NaN   NaN  22
4  NaN  11.0  17.0  23
5  6.0  12.0   NaN  24

In [109]:
missing_df.dropna()

     A    B     C   D
1  2.0  8.0  14.0  20
2  3.0  9.0  15.0  21

In [110]:
missing_df.dropna(axis = 1)

    D
0  19
1  20
2  21
3  22
4  23
5  24

In [111]:
missing_df.dropna(thresh= 3)

     A     B     C   D
0  1.0   NaN  13.0  19
1  2.0   8.0  14.0  20
2  3.0   9.0  15.0  21
4  NaN  11.0  17.0  23
5  6.0  12.0   NaN  24

In [112]:
missing_df.dropna(thresh= 4)

     A    B     C   D
1  2.0  8.0  14.0  20
2  3.0  9.0  15.0  21

In [113]:
missing_df

     A     B     C   D
0  1.0   NaN  13.0  19
1  2.0   8.0  14.0  20
2  3.0   9.0  15.0  21
3  4.0   NaN   NaN  22
4  NaN  11.0  17.0  23
5  6.0  12.0   NaN  24

In [114]:
# Groupby

In [115]:
import pandas as pd

# Sample data (fictional population counts)
data = {
    'Country': ['USA', 'China', 'India', 'Brazil'],
    '2022': [333000000, 1467000000, 1449000000, 216000000],
    '2023': [335000000, 1478000000, 1467000000, 218000000],
    '2024': [337000000, 1489000000, 1485000000, 220000000]
}

# Create DataFrame
group_df = pd.DataFrame(data)

# Set 'Country' column as index
group_df.set_index('Country', inplace=True)

#print(df)

In [116]:
group_df

               2022        2023        2024
Country
USA       333000000   335000000   337000000
China    1467000000  1478000000  1489000000
India    1449000000  1467000000  1485000000
Brazil    216000000   218000000   220000000

In [117]:
country_dat = group_df.groupby("Country")

In [118]:
country_dat

In [119]:
country_dat.mean().loc["India"]

2022    1.449000e+09
2023    1.467000e+09
2024    1.485000e+09
Name: India, dtype: float64

In [120]:
country_dat.min()

               2022        2023        2024
Country
Brazil    216000000   218000000   220000000
China    1467000000  1478000000  1489000000
India    1449000000  1467000000  1485000000
USA       333000000   335000000   337000000

In [121]:
print(country_dat.max()["2022"])
country_dat.max()["2023"]

Country
Brazil     216000000
China     1467000000
India     1449000000
USA        333000000
Name: 2022, dtype: int64

Country
Brazil     218000000
China     1478000000
India     1467000000
USA        335000000
Name: 2023, dtype: int64

In [122]:
group_df

               2022        2023        2024
Country
USA       333000000   335000000   337000000
China    1467000000  1478000000  1489000000
India    1449000000  1467000000  1485000000
Brazil    216000000   218000000   220000000

In [123]:
country_dat.mean()[["2022","2023"]]

                 2022          2023
Country
Brazil   2.160000e+08  2.180000e+08
China    1.467000e+09  1.478000e+09
India    1.449000e+09  1.467000e+09
USA      3.330000e+08  3.350000e+08

In [124]:
# Real Data

In [125]:
import pandas as pd

# Sample data (fictional population counts)
data = {
    'Country': ['USA', 'China', 'India', 'Brazil'],
    '2010': [309000000, 1334000000, 1234000000, 192000000],
    '2011': [311000000, 1347000000, 1252000000, 194000000],
    '2012': [313000000, 1355000000, 1269000000, 196000000],
    '2013': [315000000, 1368000000, 1287000000, 198000000],
    '2014': [317000000, 1380000000, 1305000000, 200000000],
    '2015': [319000000, 1390000000, 1323000000, 202000000],
    '2016': [321000000, 1401000000, 1341000000, 204000000],
    '2017': [323000000, 1412000000, 1359000000, 206000000],
    '2018': [325000000, 1423000000, 1377000000, 208000000],
    '2019': [327000000, 1434000000, 1395000000, 210000000],
    '2020': [329000000, 1445000000, 1413000000, 212000000],
    '2021': [331000000, 1456000000, 1431000000, 214000000],
    '2022': [333000000, 1467000000, 1449000000, 216000000],
    '2023': [335000000, 1478000000, 1467000000, 218000000],
    '2024': [337000000, 1489000000, 1485000000, 220000000]
}

# Create DataFrame
group_df_full = pd.DataFrame(data)

# Set 'Country' column as index
group_df_full.set_index('Country', inplace=True)

group_df_full

,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024
Country,,,,,,,,,,,,,,,
USA,309000000,311000000,313000000,315000000,317000000,319000000,321000000,323000000,325000000,327000000,329000000,331000000,333000000,335000000,337000000
China,1334000000,1347000000,1355000000,1368000000,1380000000,1390000000,1401000000,1412000000,1423000000,1434000000,1445000000,1456000000,1467000000,1478000000,1489000000
India,1234000000,1252000000,1269000000,1287000000,1305000000,1323000000,1341000000,1359000000,1377000000,1395000000,1413000000,1431000000,1449000000,1467000000,1485000000
Brazil,192000000,194000000,196000000,198000000,200000000,202000000,204000000,206000000,208000000,210000000,212000000,214000000,216000000,218000000,220000000

In [126]:
country_dat_full = group_df_full.groupby("Country")

In [127]:
country_dat_full.sum()[["2020","2018","2012"]].transpose()

Country     Brazil       China       India        USA
2020     212000000  1445000000  1413000000  329000000
2018     208000000  1423000000  1377000000  325000000
2012     196000000  1355000000  1269000000  313000000

In [128]:
year_df = group_df_full.transpose()

In [129]:
year_df.sum()[["India","USA"]]

Country
India    20387000000
USA       4845000000
dtype: int64

In [130]:
country_dat_full.describe()

         2010                                                              \
        count          mean std           min           25%           50%
Country
Brazil    1.0  1.920000e+08 NaN  1.920000e+08  1.920000e+08  1.920000e+08
China     1.0  1.334000e+09 NaN  1.334000e+09  1.334000e+09  1.334000e+09
India     1.0  1.234000e+09 NaN  1.234000e+09  1.234000e+09  1.234000e+09
USA       1.0  3.090000e+08 NaN  3.090000e+08  3.090000e+08  3.090000e+08

                                     2011                ...          2023  \
                  75%           max count          mean  ...           75%
Country                                                  ...
Brazil   1.920000e+08  1.920000e+08   1.0  1.940000e+08  ...  2.180000e+08
China    1.334000e+09  1.334000e+09   1.0  1.347000e+09  ...  1.478000e+09
India    1.234000e+09  1.234000e+09   1.0  1.252000e+09  ...  1.467000e+09
USA      3.090000e+08  3.090000e+08   1.0  3.110000e+08  ...  3.350000e+08

                       2024                                                \
                  max count          mean std           min           25%
Country
Brazil   2.180000e+08   1.0  2.200000e+08 NaN  2.200000e+08  2.200000e+08
China    1.478000e+09   1.0  1.489000e+09 NaN  1.489000e+09  1.489000e+09
India    1.467000e+09   1.0  1.485000e+09 NaN  1.485000e+09  1.485000e+09
USA      3.350000e+08   1.0  3.370000e+08 NaN  3.370000e+08  3.370000e+08


                  50%           75%           max
Country
Brazil   2.200000e+08  2.200000e+08  2.200000e+08
China    1.489000e+09  1.489000e+09  1.489000e+09
India    1.485000e+09  1.485000e+09  1.485000e+09
USA      3.370000e+08  3.370000e+08  3.370000e+08

[4 rows x 120 columns]

In [131]:
year_df.describe()

Country           USA         China         India        Brazil
count    1.500000e+01  1.500000e+01  1.500000e+01  1.500000e+01
mean     3.230000e+08  1.411933e+09  1.359133e+09  2.060000e+08
std      8.944272e+06  4.932613e+07  8.029131e+07  8.944272e+06
min      3.090000e+08  1.334000e+09  1.234000e+09  1.920000e+08
25%      3.160000e+08  1.374000e+09  1.296000e+09  1.990000e+08
50%      3.230000e+08  1.412000e+09  1.359000e+09  2.060000e+08
75%      3.300000e+08  1.450500e+09  1.422000e+09  2.130000e+08
max      3.370000e+08  1.489000e+09  1.485000e+09  2.200000e+08

In [132]:
#THalaiva

In [133]:
#8--02--2024

In [134]:
import pandas as pd
import numpy as np

In [135]:
import pandas as pd

# Example DataFrames
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value1': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D', 'E'], 'value2': [5, 6, 7, 8]})
df3 = pd.DataFrame({'key': ['C', 'D', 'E', 'F'], 'value3': [9, 10, 11, 12]})

# Concatenate DataFrames vertically
df_concat = pd.concat([df1, df2, df3],ignore_index= True)

In [136]:
df_concat

   key  value1  value2  value3
0    A     1.0     NaN     NaN
1    B     2.0     NaN     NaN
2    C     3.0     NaN     NaN
3    D     4.0     NaN     NaN
4    B     NaN     5.0     NaN
5    C     NaN     6.0     NaN
6    D     NaN     7.0     NaN
7    E     NaN     8.0     NaN
8    C     NaN     NaN     9.0
9    D     NaN     NaN    10.0
10   E     NaN     NaN    11.0
11   F     NaN     NaN    12.0

In [137]:
df_concat = pd.concat([df1, df2, df3],ignore_index= False)

In [138]:
df_concat

  key  value1  value2  value3
0   A     1.0     NaN     NaN
1   B     2.0     NaN     NaN
2   C     3.0     NaN     NaN
3   D     4.0     NaN     NaN
0   B     NaN     5.0     NaN
1   C     NaN     6.0     NaN
2   D     NaN     7.0     NaN
3   E     NaN     8.0     NaN
0   C     NaN     NaN     9.0
1   D     NaN     NaN    10.0
2   E     NaN     NaN    11.0
3   F     NaN     NaN    12.0

In [139]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [140]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [141]:
pd.concat([df1,df2,df3],axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [142]:
import pandas as pd

# Example DataFrames
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value1': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D', 'E'], 'value2': [5, 6, 7, 8]})

# Inner merge
inner_merged = pd.merge(df1, df2, on='key', how='inner')
print("Inner Merge:")
print(inner_merged)

# Outer merge
outer_merged = pd.merge(df1, df2, on='key', how='outer')
print("\nOuter Merge:")
print(outer_merged)

# Left merge
left_merged = pd.merge(df1, df2, on='key', how='left')
print("\nLeft Merge:")
print(left_merged)

# Right merge
right_merged = pd.merge(df1, df2, on='key', how='right')
print("\nRight Merge:")
print(right_merged)

Inner Merge:
  key  value1  value2
0   B       2       5
1   C       3       6
2   D       4       7

Outer Merge:
  key  value1  value2
0   A     1.0     NaN
1   B     2.0     5.0
2   C     3.0     6.0
3   D     4.0     7.0
4   E     NaN     8.0

Left Merge:
  key  value1  value2
0   A       1     NaN
1   B       2     5.0
2   C       3     6.0
3   D       4     7.0

Right Merge:
  key  value1  value2
0   B     2.0       5
1   C     3.0       6
2   D     4.0       7
3   E     NaN       8

In [143]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [144]:
pd.merge(left,right, how= "outer",on="key" )

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [145]:
pd.merge(left,right,on="key" )

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [146]:
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [147]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value1': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D', 'E'], 'value2': [5, 6, 7, 8]})

In [148]:
pd.merge(df1,df2)

  key  value1  value2
0   B       2       5
1   C       3       6
2   D       4       7

In [149]:
pd.merge(df1,df2,how="outer",on="key")

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     5.0
2   C     3.0     6.0
3   D     4.0     7.0
4   E     NaN     8.0

In [150]:
pd.merge(df1,df2,how="left",on="key")

  key  value1  value2
0   A       1     NaN
1   B       2     5.0
2   C       3     6.0
3   D       4     7.0

In [151]:
pd.merge(df1,df2,how="right",on="key")

  key  value1  value2
0   B     2.0       5
1   C     3.0       6
2   D     4.0       7
3   E     NaN       8

In [152]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [153]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [154]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [155]:
right.unstack()

C  K0    C0
   K2    C2
   K3    C3
D  K0    D0
   K2    D2
   K3    D3
dtype: object

In [156]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [157]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [158]:
df["col1"].unique()

array([1, 2, 3, 4], dtype=int64)

In [159]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [160]:
df["col2"].nunique()

3

In [161]:
df["col2"].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [162]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [163]:
newdf

   col1  col2 col3
3     4   444  xyz

In [164]:
def example_fun(x):
    return x*99

In [165]:
df['col1'].apply(example_fun)

0     99
1    198
2    297
3    396
Name: col1, dtype: int64

In [166]:
df = df.apply(example_fun)

In [167]:
df["col3"].apply(len)

0    297
1    297
2    297
3    297
Name: col3, dtype: int64

In [168]:
df['col1'].sum()

990

In [169]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [170]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [171]:
df

   col1   col2                                               col3
0    99  43956  abcabcabcabcabcabcabcabcabcabcabcabcabcabcabca...
1   198  54945  defdefdefdefdefdefdefdefdefdefdefdefdefdefdefd...
2   297  65934  ghighighighighighighighighighighighighighighig...
3   396  43956  xyzxyzxyzxyzxyzxyzxyzxyzxyzxyzxyzxyzxyzxyzxyzx...

In [174]:
labels

['One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven', 'Eight']

In [175]:
group_df

               2022        2023        2024
Country
USA       333000000   335000000   337000000
China    1467000000  1478000000  1489000000
India    1449000000  1467000000  1485000000
Brazil    216000000   218000000   220000000

In [176]:
group_df_full

,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024
Country,,,,,,,,,,,,,,,
USA,309000000,311000000,313000000,315000000,317000000,319000000,321000000,323000000,325000000,327000000,329000000,331000000,333000000,335000000,337000000
China,1334000000,1347000000,1355000000,1368000000,1380000000,1390000000,1401000000,1412000000,1423000000,1434000000,1445000000,1456000000,1467000000,1478000000,1489000000
India,1234000000,1252000000,1269000000,1287000000,1305000000,1323000000,1341000000,1359000000,1377000000,1395000000,1413000000,1431000000,1449000000,1467000000,1485000000
Brazil,192000000,194000000,196000000,198000000,200000000,202000000,204000000,206000000,208000000,210000000,212000000,214000000,216000000,218000000,220000000

In [179]:
year_df

Country        USA       China       India     Brazil
2010     309000000  1334000000  1234000000  192000000
2011     311000000  1347000000  1252000000  194000000
2012     313000000  1355000000  1269000000  196000000
2013     315000000  1368000000  1287000000  198000000
2014     317000000  1380000000  1305000000  200000000
2015     319000000  1390000000  1323000000  202000000
2016     321000000  1401000000  1341000000  204000000
2017     323000000  1412000000  1359000000  206000000
2018     325000000  1423000000  1377000000  208000000
2019     327000000  1434000000  1395000000  210000000
2020     329000000  1445000000  1413000000  212000000
2021     331000000  1456000000  1431000000  214000000
2022     333000000  1467000000  1449000000  216000000
2023     335000000  1478000000  1467000000  218000000
2024     337000000  1489000000  1485000000  220000000

In [1]:
# 20 2 2024

In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df.max(axis=0)

col1      4
col2    666
col3    xyz
dtype: object

In [10]:
df.col2.unique()

array([444, 555, 666], dtype=int64)